---
kind: property
id: P:Autodesk.Revit.DB.FaceSplitter.SplitElementId
source: html/c62f61ca-ad2b-7cf3-c9c0-fbd560f393c9.htm
---
# Autodesk.Revit.DB.FaceSplitter.SplitElementId Property

The id of the element whose face is split by this element.

## Syntax (C#)
```csharp
public ElementId SplitElementId { get; }
```